benchmark_results_host/fileio_bench_rndwr_18G_host.txt
sysbench 1.0.18 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 144MiB each
18GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     733.06
    fsyncs/s:                     939.16

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               11.45

General statistics:
    total time:                          120.0397s
    total number of events:              200614

Latency (ms):
         min:                                    0.00
         avg:                                    0.60
         max:                                   16.48
         95th percentile:                        2.43
         sum:                               119778.57

Threads fairness:
    events (avg/stddev):           200614.0000/0.00
    execution time (avg/stddev):   119.7786/0.00