benchmark_results_host/fileio_bench_seqrd_18G_host.txt
sysbench 1.0.18 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 144MiB each
18GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      46193.73
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  721.78
    written, MiB/s:               0.00

General statistics:
    total time:                          120.0002s
    total number of events:              5543351

Latency (ms):
         min:                                    0.00
         avg:                                    0.02
         max:                                    6.95
         95th percentile:                        0.18
         sum:                               118359.87

Threads fairness:
    events (avg/stddev):           5543351.0000/0.00
    execution time (avg/stddev):   118.3599/0.00